import icon1 from "@icons/benefit-icon-1.svg";
import icon2 from "@icons/benefit-icon-2.svg";
import icon3 from "@icons/benefit-icon-3.svg";

export const FEATURES_DATA = [
    {
        id: 1,
        title: "Экологично и безопасно",
        text: "Мы используем экологически безопасные чистящие средства, которые бережно удаляют грязь, не повреждая ваш автомобиль.",
        icon: icon1,
    },
    {
        id: 2,
        title: " Современные технологии",
        text: "Наша автомойка оснащена современным оборудованием, которое позволяет проводить мойку быстро и эффективно.",
        icon: icon2,
    },
    {
        id: 3,
        title: "Скидки и бонусы постоянным гостям",
        text: "Мы предлагаем специальные условия для постоянный клиентов. Зарегистрируйтесь в программе лояльности и получайте скидки!",
        icon: icon3,
    },
];
