export const FAQ_data = [
    {
        question: "1. Сколько времени занимает мойка?",
        answer: "Время обслуживания зависит от вида мойки: экспресс-мойка: 15-20 мин, стандартная: 30-40 мин, полный комплекс: 1-1.5 часа, химчистка: 2-3 часа",
    },
    {
        question: "2. Нужна ли предварительная запись?",
        answer: "Для стандартных моек запись не обязательна, для комплексных услуг и химчистки рекомендуем записываться за 1-2 дня",
    },
    {
        question: "3. Можно ли оставаться в машине во время мойки?",
        answer: "В целях безопасности при автоматической мойке пребывание в автомобиле запрещено, при ручной мойке вы можете оставаться в машине, а для химчистки салона автомобиль необходимо оставить",
    },
    {
        question: "4. Как часто нужно мыть машину?",
        answer: "Рекомендуем: зимой: каждые 7-10 дней (из-за реагентов), летом: каждые 2 недели, после поездок по бездорожью: немедленно,салон: 1 раз в 2-3 месяца",
    },
    {
        question: "5. Есть ли скидки для постоянных клиентов?",
        answer: "Да, у нас действует система промокодов. При подписке на telegram-бота вы можете получать актуальные промокоды.",
    },
    {
        question: "6. Можно ли отменить запись?",
        answer: "Да, через личный кабинет на сайте если запись еще не подтверждена или по телефону не позднее, чем за 2 часа до записи. ",
    },
];
